In [2]:
import numpy as np

In [3]:
import pandas as pd

In [6]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [7]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [8]:
dates = pd.date_range("20130101", periods=6)

In [9]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [11]:
df

                   A         B         C         D
2013-01-01  0.785936  0.925051  0.546097  0.626598
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-03  0.870681 -1.312224 -1.289514  0.336490
2013-01-04  0.643069  1.316620 -1.165604 -0.482586
2013-01-05 -0.724788  0.462118  0.076963  0.113985
2013-01-06  0.189624  0.684437 -0.093051  0.847114

In [12]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [15]:
df.head()

                   A         B         C         D
2013-01-01  0.785936  0.925051  0.546097  0.626598
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-03  0.870681 -1.312224 -1.289514  0.336490
2013-01-04  0.643069  1.316620 -1.165604 -0.482586
2013-01-05 -0.724788  0.462118  0.076963  0.113985

In [17]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.643069  1.316620 -1.165604 -0.482586
2013-01-05 -0.724788  0.462118  0.076963  0.113985
2013-01-06  0.189624  0.684437 -0.093051  0.847114

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df

                   A         B         C         D
2013-01-01  0.785936  0.925051  0.546097  0.626598
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-03  0.870681 -1.312224 -1.289514  0.336490
2013-01-04  0.643069  1.316620 -1.165604 -0.482586
2013-01-05 -0.724788  0.462118  0.076963  0.113985
2013-01-06  0.189624  0.684437 -0.093051  0.847114

In [21]:
df.to_numpy()

array([[ 0.78593571,  0.92505139,  0.54609683,  0.62659819],
       [ 1.15254769,  0.42341563,  0.52468965, -0.38131241],
       [ 0.87068125, -1.31222419, -1.28951449,  0.33649012],
       [ 0.643069  ,  1.3166196 , -1.1656044 , -0.4825859 ],
       [-0.72478777,  0.46211781,  0.07696336,  0.11398538],
       [ 0.18962409,  0.68443742, -0.09305087,  0.8471143 ]])

In [22]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.486178  0.416570 -0.233403  0.176715
std    0.672420  0.908983  0.810274  0.534297
min   -0.724788 -1.312224 -1.289514 -0.482586
25%    0.302985  0.433091 -0.897466 -0.257488
50%    0.714502  0.573278 -0.008044  0.225238
75%    0.849495  0.864898  0.412758  0.554071
max    1.152548  1.316620  0.546097  0.847114

In [23]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.785936    1.152548    0.870681    0.643069   -0.724788    0.189624
B    0.925051    0.423416   -1.312224    1.316620    0.462118    0.684437
C    0.546097    0.524690   -1.289514   -1.165604    0.076963   -0.093051
D    0.626598   -0.381312    0.336490   -0.482586    0.113985    0.847114

In [24]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.626598  0.546097  0.925051  0.785936
2013-01-02 -0.381312  0.524690  0.423416  1.152548
2013-01-03  0.336490 -1.289514 -1.312224  0.870681
2013-01-04 -0.482586 -1.165604  1.316620  0.643069
2013-01-05  0.113985  0.076963  0.462118 -0.724788
2013-01-06  0.847114 -0.093051  0.684437  0.189624

In [25]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-03  0.870681 -1.312224 -1.289514  0.336490
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-05 -0.724788  0.462118  0.076963  0.113985
2013-01-06  0.189624  0.684437 -0.093051  0.847114
2013-01-01  0.785936  0.925051  0.546097  0.626598
2013-01-04  0.643069  1.316620 -1.165604 -0.482586

In [26]:
df["A"]

2013-01-01    0.785936
2013-01-02    1.152548
2013-01-03    0.870681
2013-01-04    0.643069
2013-01-05   -0.724788
2013-01-06    0.189624
Freq: D, Name: A, dtype: float64

In [27]:
df.A

2013-01-01    0.785936
2013-01-02    1.152548
2013-01-03    0.870681
2013-01-04    0.643069
2013-01-05   -0.724788
2013-01-06    0.189624
Freq: D, Name: A, dtype: float64

In [28]:
df[0:3]

                   A         B         C         D
2013-01-01  0.785936  0.925051  0.546097  0.626598
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-03  0.870681 -1.312224 -1.289514  0.336490

In [29]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-03  0.870681 -1.312224 -1.289514  0.336490
2013-01-04  0.643069  1.316620 -1.165604 -0.482586

In [30]:
df.loc[dates[0]]

A    0.785936
B    0.925051
C    0.546097
D    0.626598
Name: 2013-01-01 00:00:00, dtype: float64

In [32]:
df[0:0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [33]:
df[1:1]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [34]:
df[0:3]

                   A         B         C         D
2013-01-01  0.785936  0.925051  0.546097  0.626598
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-03  0.870681 -1.312224 -1.289514  0.336490

In [35]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.785936  0.925051
2013-01-02  1.152548  0.423416
2013-01-03  0.870681 -1.312224
2013-01-04  0.643069  1.316620
2013-01-05 -0.724788  0.462118
2013-01-06  0.189624  0.684437

In [36]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  1.152548  0.423416
2013-01-03  0.870681 -1.312224
2013-01-04  0.643069  1.316620

In [37]:
df.loc[dates[0], "A"]

0.7859357088155114

In [39]:
df.at[dates[0], "A"]

0.7859357088155114

In [41]:
df.loc[dates[0], "A"].dtype

dtype('float64')

In [42]:
df.at[dates[0], "A"].dtype

dtype('float64')

In [43]:
df.iloc[3]

A    0.643069
B    1.316620
C   -1.165604
D   -0.482586
Name: 2013-01-04 00:00:00, dtype: float64

In [44]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.643069  1.316620
2013-01-05 -0.724788  0.462118

In [45]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.152548  0.524690
2013-01-03  0.870681 -1.289514
2013-01-05 -0.724788  0.076963

In [46]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-03  0.870681 -1.312224 -1.289514  0.336490

In [47]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.925051  0.546097
2013-01-02  0.423416  0.524690
2013-01-03 -1.312224 -1.289514
2013-01-04  1.316620 -1.165604
2013-01-05  0.462118  0.076963
2013-01-06  0.684437 -0.093051

In [48]:
df.iloc[1, 1]

0.4234156283686866

In [49]:
df.iat[1, 1]

0.4234156283686866

In [50]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.785936  0.925051  0.546097  0.626598
2013-01-02  1.152548  0.423416  0.524690 -0.381312
2013-01-03  0.870681 -1.312224 -1.289514  0.336490
2013-01-04  0.643069  1.316620 -1.165604 -0.482586
2013-01-06  0.189624  0.684437 -0.093051  0.847114

In [51]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.785936  0.925051  0.546097  0.626598
2013-01-02  1.152548  0.423416  0.524690       NaN
2013-01-03  0.870681       NaN       NaN  0.336490
2013-01-04  0.643069  1.316620       NaN       NaN
2013-01-05       NaN  0.462118  0.076963  0.113985
2013-01-06  0.189624  0.684437       NaN  0.847114

In [52]:
df2 = df.copy()

In [53]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [54]:
df2

                   A         B         C         D      E
2013-01-01  0.785936  0.925051  0.546097  0.626598    one
2013-01-02  1.152548  0.423416  0.524690 -0.381312    one
2013-01-03  0.870681 -1.312224 -1.289514  0.336490    two
2013-01-04  0.643069  1.316620 -1.165604 -0.482586  three
2013-01-05 -0.724788  0.462118  0.076963  0.113985   four
2013-01-06  0.189624  0.684437 -0.093051  0.847114  three

In [56]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.870681 -1.312224 -1.289514  0.336490   two
2013-01-05 -0.724788  0.462118  0.076963  0.113985  four

In [57]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [58]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [59]:
df["F"] = s1

In [60]:
df

                   A         B         C         D    F
2013-01-01  0.785936  0.925051  0.546097  0.626598  NaN
2013-01-02  1.152548  0.423416  0.524690 -0.381312  1.0
2013-01-03  0.870681 -1.312224 -1.289514  0.336490  2.0
2013-01-04  0.643069  1.316620 -1.165604 -0.482586  3.0
2013-01-05 -0.724788  0.462118  0.076963  0.113985  4.0
2013-01-06  0.189624  0.684437 -0.093051  0.847114  5.0

In [61]:
df.at[dates[0], "A"] = 0

In [62]:
df.iat[0, 1] = 0

In [63]:
df.loc[:, "D"] = np.array([5] * len(df))

In [64]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.546097  5.0  NaN
2013-01-02  1.152548  0.423416  0.524690  5.0  1.0
2013-01-03  0.870681 -1.312224 -1.289514  5.0  2.0
2013-01-04  0.643069  1.316620 -1.165604  5.0  3.0
2013-01-05 -0.724788  0.462118  0.076963  5.0  4.0
2013-01-06  0.189624  0.684437 -0.093051  5.0  5.0

In [65]:
df2 = df.copy()

In [66]:
df2[df2 > 0] = -df2

In [67]:
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.546097 -5.0  NaN
2013-01-02 -1.152548 -0.423416 -0.524690 -5.0 -1.0
2013-01-03 -0.870681 -1.312224 -1.289514 -5.0 -2.0
2013-01-04 -0.643069 -1.316620 -1.165604 -5.0 -3.0
2013-01-05 -0.724788 -0.462118 -0.076963 -5.0 -4.0
2013-01-06 -0.189624 -0.684437 -0.093051 -5.0 -5.0

In [69]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [70]:
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000  0.546097  5.0  NaN NaN
2013-01-02  1.152548  0.423416  0.524690  5.0  1.0 NaN
2013-01-03  0.870681 -1.312224 -1.289514  5.0  2.0 NaN
2013-01-04  0.643069  1.316620 -1.165604  5.0  3.0 NaN

In [71]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [72]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.546097  5.0  NaN  1.0
2013-01-02  1.152548  0.423416  0.524690  5.0  1.0  1.0
2013-01-03  0.870681 -1.312224 -1.289514  5.0  2.0  NaN
2013-01-04  0.643069  1.316620 -1.165604  5.0  3.0  NaN

In [73]:
df1.dropna(how="any")

                   A         B        C    D    F    E
2013-01-02  1.152548  0.423416  0.52469  5.0  1.0  1.0

In [74]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  0.546097  5.0  5.0  1.0
2013-01-02  1.152548  0.423416  0.524690  5.0  1.0  1.0
2013-01-03  0.870681 -1.312224 -1.289514  5.0  2.0  5.0
2013-01-04  0.643069  1.316620 -1.165604  5.0  3.0  5.0

In [75]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [76]:
df.mean()

A    0.355189
B    0.262394
C   -0.233403
D    5.000000
F    3.000000
dtype: float64

In [77]:
df.mean(axis=1)

2013-01-01    1.386524
2013-01-02    1.620131
2013-01-03    1.053789
2013-01-04    1.758817
2013-01-05    1.762859
2013-01-06    2.156202
Freq: D, dtype: float64

In [79]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [80]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [81]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.129319 -2.312224 -2.289514  4.0  1.0
2013-01-04 -2.356931 -1.683380 -4.165604  2.0  0.0
2013-01-05 -5.724788 -4.537882 -4.923037  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [82]:
df.agg(lambda x: np.mean(x) * 5.6)

A     1.989059
B     1.469409
C    -1.307059
D    28.000000
F    16.800000
dtype: float64

In [83]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000   55.264999  506.0    NaN
2013-01-02  116.637826   42.849662   53.098593  506.0  101.2
2013-01-03   88.112942 -132.797088 -130.498866  506.0  202.4
2013-01-04   65.078583  133.241904 -117.959165  506.0  303.6
2013-01-05  -73.348522   46.766323    7.788692  506.0  404.8
2013-01-06   19.189958   69.265067   -9.416748  506.0  506.0

In [84]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    1
2    0
3    4
4    2
5    3
6    5
7    5
8    0
9    3
dtype: int64

In [85]:
s.value_counts()

3    3
0    2
5    2
1    1
4    1
2    1
Name: count, dtype: int64

In [86]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [87]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [4]:
df = pd.DataFrame(np.random.randn(10, 4))

In [5]:
df

          0         1         2         3
0 -0.022564 -1.398685 -1.030086  1.221671
1  0.208248 -0.293977 -1.477860 -0.891016
2  0.641726 -0.164538 -0.388902 -0.741637
3 -0.971353 -0.954046 -0.612071  1.901583
4  0.031282  0.234270  0.472993  1.143508
5 -0.341054 -0.602995  1.590526 -0.557383
6  0.622189  0.200496 -1.990431  0.175223
7  0.894085  0.123851 -0.789211 -0.473547
8  1.031124  0.704603 -0.531722 -0.287091
9  1.056611  0.717771  0.506092 -0.567388

In [6]:
pieces = [df[:3], df[3:7], df[7:]]

In [7]:
pieces

[          0         1         2         3
 0 -0.022564 -1.398685 -1.030086  1.221671
 1  0.208248 -0.293977 -1.477860 -0.891016
 2  0.641726 -0.164538 -0.388902 -0.741637,
           0         1         2         3
 3 -0.971353 -0.954046 -0.612071  1.901583
 4  0.031282  0.234270  0.472993  1.143508
 5 -0.341054 -0.602995  1.590526 -0.557383
 6  0.622189  0.200496 -1.990431  0.175223,
           0         1         2         3
 7  0.894085  0.123851 -0.789211 -0.473547
 8  1.031124  0.704603 -0.531722 -0.287091
 9  1.056611  0.717771  0.506092 -0.567388]

In [8]:
pd.concat(pieces)

          0         1         2         3
0 -0.022564 -1.398685 -1.030086  1.221671
1  0.208248 -0.293977 -1.477860 -0.891016
2  0.641726 -0.164538 -0.388902 -0.741637
3 -0.971353 -0.954046 -0.612071  1.901583
4  0.031282  0.234270  0.472993  1.143508
5 -0.341054 -0.602995  1.590526 -0.557383
6  0.622189  0.200496 -1.990431  0.175223
7  0.894085  0.123851 -0.789211 -0.473547
8  1.031124  0.704603 -0.531722 -0.287091
9  1.056611  0.717771  0.506092 -0.567388

In [14]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})

In [15]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [16]:
left

   key  lval
0  foo     1
1  bar     2

In [17]:
right

   key  rval
0  foo     4
1  bar     5

In [18]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [19]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [20]:
df

     A      B         C         D
0  foo    one -0.066929  0.167493
1  bar    one  0.028309 -0.566082
2  foo    two  1.162192 -0.893247
3  bar  three -1.554623  0.713548
4  foo    two -0.521528 -0.267977
5  bar    two -0.122611 -1.390291
6  foo    one  1.215437 -1.035898
7  foo  three -1.643280 -0.413180

In [21]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.028309 -0.566082
    three -1.554623  0.713548
    two   -0.122611 -1.390291
foo one    1.148508 -0.868405
    three -1.643280 -0.413180
    two    0.640664 -1.161224

In [22]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]

In [23]:
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [24]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [25]:
df

                     A         B
first second
bar   one    -0.478584 -0.613326
      two     0.391559  0.719580
baz   one     0.602744  0.149608
      two    -1.074798  0.665056
foo   one     1.127754 -0.388051
      two     1.030651  1.123877
qux   one     0.577178 -0.597168
      two    -1.091582 -1.012904

In [26]:
df2 = df[:4]

In [27]:
df2

                     A         B
first second
bar   one    -0.478584 -0.613326
      two     0.391559  0.719580
baz   one     0.602744  0.149608
      two    -1.074798  0.665056

In [28]:
stacked = df2.stack(future_stack=True)

In [29]:
stacked

first  second
bar    one     A   -0.478584
               B   -0.613326
       two     A    0.391559
               B    0.719580
baz    one     A    0.602744
               B    0.149608
       two     A   -1.074798
               B    0.665056
dtype: float64

In [30]:
stacked.unstack()

                     A         B
first second
bar   one    -0.478584 -0.613326
      two     0.391559  0.719580
baz   one     0.602744  0.149608
      two    -1.074798  0.665056

In [31]:
stacked.unstack(1)

second        one       two
first
bar   A -0.478584  0.391559
      B -0.613326  0.719580
baz   A  0.602744 -1.074798
      B  0.149608  0.665056

In [32]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.478584  0.602744
       B -0.613326  0.149608
two    A  0.391559 -1.074798
       B  0.719580  0.665056

In [33]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [34]:
df

        A  B    C         D         E
0     one  A  foo  0.818530 -0.192814
1     one  B  foo  0.291171 -0.245533
2     two  C  foo  1.453668  0.626963
3   three  A  bar  0.332173  0.115133
4     one  B  bar  1.624338  0.061799
5     one  C  bar -1.039770  1.283078
6     two  A  foo  0.494186  0.002241
7   three  B  foo -2.476894 -0.068799
8     one  C  foo -0.590931  0.190572
9     one  A  bar  0.217571  0.551631
10    two  B  bar  0.366001 -0.198948
11  three  C  bar -0.481918 -0.580273

In [35]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  0.217571  0.818530
      B  1.624338  0.291171
      C -1.039770 -0.590931
three A  0.332173       NaN
      B       NaN -2.476894
      C -0.481918       NaN
two   A       NaN  0.494186
      B  0.366001       NaN
      C       NaN  1.453668

In [36]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

In [37]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [38]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [39]:
ts

2012-01-01 00:00:00    316
2012-01-01 00:00:01    304
2012-01-01 00:00:02    163
2012-01-01 00:00:03    311
2012-01-01 00:00:04    161
                      ...
2012-01-01 00:01:35    266
2012-01-01 00:01:36    324
2012-01-01 00:01:37    371
2012-01-01 00:01:38    347
2012-01-01 00:01:39    396
Freq: S, Length: 100, dtype: int64

In [40]:
ts.resample("5Min").sum()

2012-01-01    22780
Freq: 5T, dtype: int64

In [41]:
ts.resample("5Min")

In [42]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")

In [43]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [44]:
ts

2012-03-06    1.269641
2012-03-07   -0.486618
2012-03-08   -0.834319
2012-03-09   -0.712225
2012-03-10   -0.070933
Freq: D, dtype: float64

In [45]:
ts_utc = ts.tz_localize("UTC")

In [46]:
ts_utc

2012-03-06 00:00:00+00:00    1.269641
2012-03-07 00:00:00+00:00   -0.486618
2012-03-08 00:00:00+00:00   -0.834319
2012-03-09 00:00:00+00:00   -0.712225
2012-03-10 00:00:00+00:00   -0.070933
Freq: D, dtype: float64

In [47]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    1.269641
2012-03-06 19:00:00-05:00   -0.486618
2012-03-07 19:00:00-05:00   -0.834319
2012-03-08 19:00:00-05:00   -0.712225
2012-03-09 19:00:00-05:00   -0.070933
Freq: D, dtype: float64

In [49]:
ts_utc.tz_convert("US/Pacific")

2012-03-05 16:00:00-08:00    1.269641
2012-03-06 16:00:00-08:00   -0.486618
2012-03-07 16:00:00-08:00   -0.834319
2012-03-08 16:00:00-08:00   -0.712225
2012-03-09 16:00:00-08:00   -0.070933
Freq: D, dtype: float64

In [50]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [51]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)